In [1]:
import numpy as np
import pandas as pd

## series

In [2]:
# one dimensional array like structure along with indices as label

In [3]:
s1 = pd.Series([34 , 28 ,62 ,365 ,79 , 64 ,19 , 69]) # series givea index
s1

0     34
1     28
2     62
3    365
4     79
5     64
6     19
7     69
dtype: int64

In [4]:
print(s1[0])
print(s1[1])
print(s1[2])
print(s1[3])
print(s1[4])
print(s1[5])
print(s1[6])
print(s1[7])

34
28
62
365
79
64
19
69

In [5]:
print(s1[0:1]) # 0 start and 1 is end

0    34
dtype: int64

In [6]:
print(s1[0::2]) # 0 start and 2 is step

0    34
2    62
4    79
6    19
dtype: int64

## DataFrame

### dict of list

In [7]:
# A multi dimensional (2d) array like structure along with indices as label.

In [8]:
# dict of list

df = pd.DataFrame({
    "name" : ["shivani" , "vishva" , "khushi"],
    "age" : [18 , 20 , 25],
    "marks" : [60 , 50 , 99]
    })

df

      name  age  marks
0  shivani   18     60
1   vishva   20     50
2   khushi   25     99

In [9]:
df["name"]

0    shivani
1     vishva
2     khushi
Name: name, dtype: object

In [10]:
df[["name" , "marks"]] # for multiple column --> list given

      name  marks
0  shivani     60
1   vishva     50
2   khushi     99

In [11]:
print(df["name"])
print(df["age"])
print(df["marks"])

0    shivani
1     vishva
2     khushi
Name: name, dtype: object
0    18
1    20
2    25
Name: age, dtype: int64
0    60
1    50
2    99
Name: marks, dtype: int64

In [12]:
df

      name  age  marks
0  shivani   18     60
1   vishva   20     50
2   khushi   25     99

In [13]:
df["city"] = ["mumbai" , "delhi" , "goa"] # for add value and key
df

      name  age  marks    city
0  shivani   18     60  mumbai
1   vishva   20     50   delhi
2   khushi   25     99     goa

In [14]:
df["city"] = ["rajkot" , "ahmedabad" , "gujarat"] # for update value and key
df

      name  age  marks       city
0  shivani   18     60     rajkot
1   vishva   20     50  ahmedabad
2   khushi   25     99    gujarat

In [15]:
print(df["age"].dtype) # type of specifice key of dict

int64

In [16]:
type(df) # type of dic

pandas.core.frame.DataFrame

In [17]:
type(s1) # type are given

pandas.core.series.Series

In [18]:
df["marks"]

0    60
1    50
2    99
Name: marks, dtype: int64

In [19]:
df ["marks"] + 2 # brodcasting +2 in every element --> oringinal dataframe change nahi hota

0     62
1     52
2    101
Name: marks, dtype: int64

In [20]:
df

      name  age  marks       city
0  shivani   18     60     rajkot
1   vishva   20     50  ahmedabad
2   khushi   25     99    gujarat

In [21]:
df ["marks"] - 2 # brodcasting -2 in every element --> oringinal dataframe change nahi hota

0    58
1    48
2    97
Name: marks, dtype: int64

In [22]:
df ["marks"] * 2 # brodcasting *2 in every element --> oringinal dataframe change nahi hota

0    120
1    100
2    198
Name: marks, dtype: int64

In [23]:
df ["marks"] / 2 # brodcasting /2 in every element --> oringinal dataframe change nahi hota

0    30.0
1    25.0
2    49.5
Name: marks, dtype: float64

In [24]:
df

      name  age  marks       city
0  shivani   18     60     rajkot
1   vishva   20     50  ahmedabad
2   khushi   25     99    gujarat

In [25]:
df["marks"] = df["marks"] + 2 # for changes in original data frame 
df

      name  age  marks       city
0  shivani   18     62     rajkot
1   vishva   20     52  ahmedabad
2   khushi   25    101    gujarat

# list of list

In [26]:
df2 =pd.DataFrame([
    ["aryan" , "vansh" , "manav"],
    [20 , 25 , 60],
    [98 , 86 , 67]   
]) 
df2

       0      1      2
0  aryan  vansh  manav
1     20     25     60
2     98     86     67

In [27]:
df2 = pd.DataFrame([
    ["aryan" , "vansh" , "manav"],
    [20 , 25 , 60],
    [98 , 86 , 67], 
] , index = ["name" , "age" , "marks"])
df2 # raws indexing key

           0      1      2
name   aryan  vansh  manav
age       20     25     60
marks     98     86     67

In [28]:
df3 = pd.DataFrame([
    ["aryan" , "vansh" , "manav"],
    [20 , 25 , 60],
    [98 , 86 , 67], 
] , columns = ["name" , "age" , "marks"])
df3  # columns indexing key

    name    age  marks
0  aryan  vansh  manav
1     20     25     60
2     98     86     67

In [29]:
type(df) #df ka type

pandas.core.frame.DataFrame

In [ ]:
type(df3["name"]) #df ka type

pandas.core.series.Series

In [ ]:
df3.dtypes #df ke data ka type

name     object
age      object
marks    object
dtype: object

### iloc & loc

- loc : label based indexing
- iloc: interger based indexing

In [32]:
df

      name  age  marks       city
0  shivani   18     62     rajkot
1   vishva   20     52  ahmedabad
2   khushi   25    101    gujarat

In [33]:
df.iloc[2] # for raw

name      khushi
age           25
marks        101
city     gujarat
Name: 2, dtype: object

In [34]:
df.iloc[0:2] # raw , columns

      name  age  marks       city
0  shivani   18     62     rajkot
1   vishva   20     52  ahmedabad

In [35]:
df.iloc[0::2] # start , no value is for end which is from at the end , steps

      name  age  marks     city
0  shivani   18     62   rajkot
2   khushi   25    101  gujarat

In [36]:
df.iloc[0:2 , 0:2] # first 0:2 ka 0 for start and 2 for end of raws , second 0:2 ka 0 for start and 2 for end of column

      name  age
0  shivani   18
1   vishva   20

In [37]:
df

      name  age  marks       city
0  shivani   18     62     rajkot
1   vishva   20     52  ahmedabad
2   khushi   25    101    gujarat

In [38]:
df.loc[0] # label based

name     shivani
age           18
marks         62
city      rajkot
Name: 0, dtype: object

In [39]:
df2

           0      1      2
name   aryan  vansh  manav
age       20     25     60
marks     98     86     67

In [40]:
df

      name  age  marks       city
0  shivani   18     62     rajkot
1   vishva   20     52  ahmedabad
2   khushi   25    101    gujarat

In [41]:
df3

    name    age  marks
0  aryan  vansh  manav
1     20     25     60
2     98     86     67

In [ ]:
df3 = df.set_index("name")# how to set index from exiting columns

In [43]:
df3

         age  marks       city
name
shivani   18     62     rajkot
vishva    20     52  ahmedabad
khushi    25    101    gujarat

In [44]:
df3.loc["shivani"] # given all data of shivani

age          18
marks        62
city     rajkot
Name: shivani, dtype: object

In [45]:
df3.loc[["shivani","khushi","vishva"]]

         age  marks       city
name
shivani   18     62     rajkot
khushi    25    101    gujarat
vishva    20     52  ahmedabad

In [46]:
df3.loc[["shivani","khushi"]] # end number is includive

         age  marks     city
name
shivani   18     62   rajkot
khushi    25    101  gujarat

In [47]:
df3.loc[df3["city"]!="rajkot"] # filter data rajkot vali value hogi to nahi dega

        age  marks       city
name
vishva   20     52  ahmedabad
khushi   25    101    gujarat